{
    "id": "2",
    "name": "Karl",
    "chat": [
        [
            "user2",
            "Karl Marx[6] (/mɑːrks/;[7] German: [ˈkaɐ̯l ˈmaɐ̯ks]; 5 May 1818 – 14 March 1883) was a Prussian-born philosopher, economist, political theorist, sociologist, journalist, and revolutionary socialist. Born in Trier to a middle-class family, he later studied political economy and Hegelian philosophy. As an adult, Marx became stateless and spent much of his life in London, England, where he continued to develop his thought in collaboration with German thinker Friedrich Engels and published various works, the most well-known being the 1848 pamphlet The Communist Manifesto. His work has since influenced subsequent intellectual, economic, and political history."
        ],
        [
            "user2",
            "Largely non-religious, Heinrich was a man of the Enlightenment, interested in the ideas of the philosophers Immanuel Kant and Voltaire. A classical liberal, he took part in agitation for a constitution and reforms in Prussia, then governed by an absolute monarchy.[21] In 1815 Heinrich Marx began work as an attorney, in 1819 moving his family to a ten-room property near the Porta Nigra.[22] His wife, a Dutch Jewish woman, Henriette Pressburg, was from a prosperous business family that later founded the company Philips Electronics: she was great-aunt to Anton and Gerard Philips, and great-great-aunt to Frits Philips. Her sister Sophie Pressburg (1797–1854), was Marx's aunt and was married to Lion Philips (1794–1866) Marx's uncle through this marriage, and was the grandmother of both Gerard and Anton Philips. Lion Philips was a wealthy Dutch tobacco manufacturer and industrialist, upon whom Karl and Jenny Marx would later often come to rely for loans while they were exiled in London.[23]"
        ],
        [
            "user1",
            "By 1837, Marx was writing both fiction and non-fiction, having completed a short novel, Scorpion and Felix, a drama, Oulanem, and a number of love poems dedicated to Jenny von Westphalen, though none of this early work was published during his lifetime.[42] Marx soon abandoned fiction for other pursuits, including the study of both English and Italian, art history and the translation of Latin classics.[43] He began co-operating with Bruno Bauer on editing Hegel's Philosophy of Religion in 1840. Marx was also engaged in writing his doctoral thesis, The Difference Between the Democritean and Epicurean Philosophy of Nature,[44] which he completed in 1841. It was described as \"a daring and original piece of work in which Marx set out to show that theology must yield to the superior wisdom of philosophy\".[45] The essay was controversial, particularly among the conservative professors at the University of Berlin. Marx decided, instead, to submit his thesis to the more liberal University of Jena, whose faculty awarded him his PhD in April 1841.[46] As Marx and Bauer were both atheists, in March 1841 they began plans for a journal entitled Archiv des Atheismus (Atheistic Archives), but it never came to fruition. In July, Marx and Bauer took a trip to Bonn from Berlin. There they scandalised their class by getting drunk, laughing in church, and galloping through the streets on donkeys.[47]"
        ]
    ]
}